# Напишите программу, которая найдёт произведение
# пар чисел списка. Парой считаем первый и последний элемент,
# второй и предпоследний и т.д.

#     Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

#РЕШЕНО!!!
a = [2, 3, 4, 5, 6, 12, 8, 9, 10]

def sumpair(x):
    l = len(x)
    l1 = round(l/2, 5)
    y=[]
    for i in range(len(x)):
        if i < l1:
            p = x[i] * x[l-1]
            l -= 1
            y.append(p)
    return y

b = sumpair(a)
print(a)
print(b)
